name: "preproc"
backend: "python"
max_batch_size: 0
input [
  {
    name: "FRAME"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]
output [
  {
    name: "IMAGES"
    data_type: TYPE_FP32
    dims: [ 1, 3, 640, 640 ]
  },
  {
    name: "META"
    data_type: TYPE_FP32
    dims: [ 12 ]
  }
]
instance_group [
  {
    kind: KIND_CPU
    count: 2
  }
]
