name: "coco80"
platform: "ensemble"
max_batch_size: 0
input [
  {
    name: "FRAME"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]
output [
  {
    name: "DETECTIONS"
    data_type: TYPE_FP32
    dims: [ -1, 6 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "preproc"
      model_version: -1
      input_map {
        key: "FRAME"
        value: "FRAME"
      }
      output_map {
        key: "IMAGES"
        value: "IMAGES"
      }
      output_map {
        key: "META"
        value: "META"
      }
    },
    {
      model_name: "yolov8s"
      model_version: -1
      input_map {
        key: "images"
        value: "IMAGES"
      }
      output_map {
        key: "output0"
        value: "YOLO_RAW"
      }
    },
    {
      model_name: "postproc"
      model_version: -1
      input_map {
        key: "YOLO_RAW"
        value: "YOLO_RAW"
      }
      input_map {
        key: "META"
        value: "META"
      }
      output_map {
        key: "DETECTIONS"
        value: "DETECTIONS"
      }
    }
  ]
}
