name: "painter"
backend: "python"
max_batch_size: 0
input [
  {
    name: "FRAME"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  },
  {
    name: "META"
    data_type: TYPE_FP32
    dims: [ 12 ]
  },
  {
    name: "TBOXES"
    data_type: TYPE_FP32
    dims: [ -1, 4 ]
  },
  {
    name: "TIDS"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "TCLSID"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "CONFIDENCE"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
output [
  {
    name: "OUT_FRAME"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]
instance_group [
  {
    kind: KIND_CPU
    count: 2
  }
]
